//===================================================
//
//チュートリアル画面処理
//Author 奥定伊吹
//
//===================================================
#include "main.h"
#include "input.h"
#include "sound.h"
#include "fade.h"

//===================================================
//チュートリアル画面初期化処理
//===================================================
void InitTutorial(void)
{
	
}

//===================================================
//チュートリアル画面終了処理
//===================================================
void UninitTutorial(void)
{
	
}

//===================================================
//チュートリアル画面更新処理
//===================================================
void UpdateTutorial(void)
{

	if (GetKeyboardTrigger(DIK_RETURN) == true 
		|| GetJoyPadButtonTrigger(KEY_START, 0) == true 
		|| GetJoyPadButtonTrigger(KEY_A, 0) == true)
	{
		SetFade(MODE_GAME);
	}

}

//===================================================
//チュートリアル画面描画処理
//===================================================
void DrawTutorial(void)
{
	
}
